package course.stringBuffer_1125;

public class Demo1 {
    public static void main(String[] args) {
        /*String 类型的对象是不可改变的，一旦创建了一个字符串对象，他的内容是不可变的，如果需要改变，可以创建一个新的
        字符串。
        StringBuffer类：线程安全的可变字符序列。 通过某些方法的调用可以改变该序列的长度和内容 。好处：使用StringBuffer
        作字符串的拼接，不会浪费太多的空间。
        线程安全：在多线程编码时，计算机程序代码中的一个概念。 在拥有共享数据的多条线程并行执行的程序中，线程安全的代码通过
        同步机制，保证各个线程正常且正确的执行，不会出现数据污染等意外情况。
        安全 --> 同步 --> 数据是安全的 --> 例如：医院的网站，银行的网站
        不安全 --> 不同步 --> 效率高一些 --> 例如：新闻类网站，论坛等
        *
        * */
    }
}
